app/controllers/students_controller.rb

  def create
    @student = Student.new(students_params(:first_name, :last_name))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-08-02 02:21:47.861444"], ["updated_at", "2018-08-02 02:21:47.861444"]]